[DataFrame 에서 원소]<hr>

[1] 모듈로딩 및 데이터 준비 <hr>

In [40]:
# [1-1] 모듈로딩
import pandas as pd

In [41]:
# [1-2] 데이터 준비
DATA_FILE = '../DATA/member.csv'

In [42]:
# [2-1] 데이터 로딩
memberDF = pd.read_csv(DATA_FILE)

In [43]:
# [2-2] 데이터 확인
# -요약 정보 확인 => DF객체변수명.info()

memberDF.info() 
print(f"index {memberDF.index}")
print(f"columns {memberDF.columns}")
print(f"values {memberDF.values}")

print(f"head(){memberDF.head()}")
print(f"tail(){memberDF.tail()}")
print(f"type {type(memberDF)}")
print(f"shape {memberDF.shape}")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   번호      7 non-null      int64
 1   이름      7 non-null      object
 2   나이      7 non-null      int64
 3   지역      7 non-null      object
dtypes: int64(2), object(2)
memory usage: 352.0+ bytes
index RangeIndex(start=0, stop=7, step=1)
columns Index(['번호', '이름', '나이', '지역'], dtype='object')
values [[1 '홍길동' 20 '대구']
 [2 '이나영' 12 '서울']
 [3 '최희진' 22 '마산']
 [4 '마징가' 31 '부산']
 [5 '박지민' 17 '대구']
 [6 '김나나' 25 '서울']
 [7 '박서희' 33 '광주']]
head()   번호   이름  나이  지역
0   1  홍길동  20  대구
1   2  이나영  12  서울
2   3  최희진  22  마산
3   4  마징가  31  부산
4   5  박지민  17  대구
tail()   번호   이름  나이  지역
2   3  최희진  22  마산
3   4  마징가  31  부산
4   5  박지민  17  대구
5   6  김나나  25  서울
6   7  박서희  33  광주
type <class 'pandas.core.frame.DataFrame'>
shape (7, 4)

In [44]:
# 실제 데이터 확인 => DF객체변수명.head(), DF객체변수명.tail() 

memberDF.head(2)

   번호   이름  나이  지역
0   1  홍길동  20  대구
1   2  이나영  12  서울

In [45]:
# 컬럼별 통계치 확인 => DF객체변수명.describe()
memberDF.describe(include='all')

              번호   이름         나이   지역
count   7.000000    7   7.000000    7
unique       NaN    7        NaN    5
top          NaN  홍길동        NaN   대구
freq         NaN    1        NaN    2
mean    4.000000  NaN  22.857143  NaN
std     2.160247  NaN   7.470577  NaN
min     1.000000  NaN  12.000000  NaN
25%     2.500000  NaN  18.500000  NaN
50%     4.000000  NaN  22.000000  NaN
75%     5.500000  NaN  28.000000  NaN
max     7.000000  NaN  33.000000  NaN

[3] 원소 선택 <hr>

In [46]:
# - 원소 선택 : DF객체변수명.loc[행인덱스,열인덱스]

memberDF

   번호   이름  나이  지역
0   1  홍길동  20  대구
1   2  이나영  12  서울
2   3  최희진  22  마산
3   4  마징가  31  부산
4   5  박지민  17  대구
5   6  김나나  25  서울
6   7  박서희  33  광주

In [47]:
# 마징가 추출
memberDF.loc[3,'이름'], memberDF.iloc[3,1]

('마징가', '마징가')

In [48]:
# 컬럼2
memberDF.loc[3,['이름','나이']], memberDF.iloc[3,[1,2]]

(이름    마징가
 나이     31
 Name: 3, dtype: object,
 이름    마징가
 나이     31
 Name: 3, dtype: object)

In [49]:
# 마징가, 31, 부산 : 컬럼3

memberDF.iloc[ 3, 1:]

print(f"memberDF.loc[ 3, '이름':'지역'] = {memberDF.loc[ 3, '이름':'지역']}")

memberDF.loc[ 3, '이름':'지역'] = 이름    마징가
나이     31
지역     부산
Name: 3, dtype: object

In [52]:
# 마징가 ~ 박지민  이름과 나이 추출: 2개 , 2개 추출
memberDF.iloc[3:5, 1:]

memberDF.loc[[3,4],['이름','나이']]

    이름  나이
3  마징가  31
4  박지민  17

In [54]:
# 홍길동 ~ 김나나 까지 이름 과 나이 추출 

memberDF.loc[:5,['이름','나이']]

    이름  나이
0  홍길동  20
1  이나영  12
2  최희진  22
3  마징가  31
4  박지민  17
5  김나나  25

In [58]:
# 홍길동, 최희진, 박지민, 박서희 이름과 나이 추출

memberDF.iloc[::2,:3]

   번호   이름  나이
0   1  홍길동  20
2   3  최희진  22
4   5  박지민  17
6   7  박서희  33

In [60]:
# Hard-Codunf 방지 위해서
memberDF.loc[::2,memberDF.columns[1:3] ]

    이름  나이
0  홍길동  20
2  최희진  22
4  박지민  17
6  박서희  33

In [61]:
memberDF.index[::2]

RangeIndex(start=0, stop=7, step=2)